Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: The easiest way to define your transaction boundaries is to use the `@Transactional` annotation on your entry method (`jakarta.transaction.Transactional`).
pt_br: A forma mais fácil de definir os limites da sua transação é utilizar a anotação `@Transactional` no seu método de entrada ( `jakarta.transaction.Transactional`).

source: The environment executing step `1` only needs Java and Maven (or Gradle) installed, while the environment executing step `3` only needs a GraalVM installation (including the `native-image` feature).
pt_br: O ambiente que executa o passo `1` apenas necessita do Java e Maven (ou Gradle) instalados, enquanto o ambiente que executa o passo `3` apenas necessita de uma instalação GraalVM (incluindo a funcionalidade `native-image` ).

source: The extra description of the client version. The length cannot exceed 64.
pt_br: A descrição extra da versão do cliente. O comprimento não pode exceder 64.

source: The field use to manipulate keys
pt_br: O campo utilizado para manipular chaves

source: The field use to manipulate the counter
pt_br: O campo utilizado para manipular o contador

source: The first stage builds the native executable using Maven or Gradle
pt_br: O primeiro estágio faz o build do executável nativo utilizando o Maven ou o Gradle

source: The following example enables transaction support:
pt_br: O exemplo seguinte ativa o suporte de transação:

source: The following semantics are supported:
pt_br: A seguinte semântica é suportada:

source: The following table lists the supported properties:
pt_br: A tabela seguinte lista as propriedades suportadas:

source: The following table summarizes the options:
pt_br: A tabela seguinte resume as opções:

source: The following will build all modules in the Quarkus repository (except test modules) and install them in your local maven repository with the `999-SNAPSHOT` version:
pt_br: O seguinte comando irá construir todos os módulos no repositório do Quarkus (exceto módulos de teste) e instalá-los em seu repositório maven local com a versão '999-SNAPSHOT':

source: The following will build all modules in the Quarkus repository except docs and test modules and install them in your local maven repository with the `999-SNAPSHOT` version:
pt_br: O seguinte comando irá construir todos os módulos no repositório Quarkus, exceto os módulos docs e de teste, e instalá-los no seu repositório Maven local com a versão `999-SNAPSHOT`:

source: The format is simple: one class per line.
pt_br: O formato é simples: uma classe por linha.

source: The implementation class of ServiceUrlProvider used to generate ServiceUrl.
pt_br: A classe de implementação de ServiceUrlProvider usada para gerar ServiceUrl.

source: The key that will be used as the Redis key
pt_br: A variável `chave` que será utilizada como chave do Redis

source: The less easy way is to inject a `UserTransaction` and use the various transaction demarcation methods.
pt_br: A forma menos fácil é injetar um `UserTransaction` e utilizar os vários métodos de demarcação de transacções.

source: The live coding fast feedback loop was very useful when developing with Quarkus. Although fast startup was nice, it wasn’t critical since our apps are long-running, but during development, as we tweaked our APIs, being able to immediately re-test saved us a ton of development time.
pt_br: O loop de feedback rápido de codificação ao vivo foi muito útil ao desenvolver com o Quarkus. Embora a inicialização rápida tenha sido boa, não foi crítica, já que nossos aplicativos são de longa duração, mas durante o desenvolvimento, à medida que ajustamos nossas APIs, ser capaz de testar novamente imediatamente nos economizou muito tempo de desenvolvimento.

source: The max total receiver queue size across partitions. + This setting reduces the receiver queue size for individual partitions if the total receiver queue size exceeds this value.
pt_br: O tamanho máximo total da fila do receptor nas partições. + Essa configuração reduz o tamanho da fila do receptor para partições individuais se o tamanho total da fila do receptor exceder esse valor.

source: The maximum number of messages permitted in a batch.
pt_br: O número máximo de mensagens permitidas em um lote.

source: The maximum number of messages to be written to Kafka concurrently. It limits the number of messages waiting to be written and acknowledged by the broker. You can set this attribute to `0` remove the limit Type: _long_
pt_br: O número máximo de mensagens a serem gravadas em Kafka simultaneamente. Ele limita o número de mensagens aguardando para serem escritas e reconhecidas pelo corretor. Você pode definir esse atributo como '0' remover o limite Tipo: _long_

source: The maximum number of pending messages across partitions. Use the setting to lower the max pending messages for each partition (`#setMaxPendingMessages(int)`) if the total number exceeds the configured value.
pt_br: O número máximo de mensagens pendentes entre partições. Use a configuração para diminuir o máximo de mensagens pendentes para cada partição ('#setMaxPendingMessages(int)') se o número total exceder o valor configurado.

source: The maximum size of a queue holding pending chunked messages. When the threshold is reached, the consumer drops pending messages to optimize memory utilization.
pt_br: O tamanho máximo de uma fila que contém mensagens em partes pendentes. Quando o limite é atingido, o consumidor descarta mensagens pendentes para otimizar a utilização da memória.

source: The maximum size of a queue holding pending messages, i.e messages waiting to receive an acknowledgment from a broker
pt_br: O tamanho máximo de uma fila que contém mensagens pendentes, ou seja, mensagens aguardando para receber uma confirmação de um broker

source: The maximum size of a queue holding pending messages. For example, a message waiting to receive an acknowledgment from a https://pulsar.apache.org/docs/reference-terminology#broker[broker]. By default, when the queue is full, all calls to the `Send` and `SendAsync` methods fail **unless** you set `BlockIfQueueFull` to `true`.
pt_br: O tamanho máximo de uma fila que contém mensagens pendentes. Por exemplo, uma mensagem aguardando para receber uma confirmação de um https://pulsar.apache.org/docs/reference-terminologia#broker[broker]. Por padrão, quando a fila está cheia, todas as chamadas para os métodos 'Send' e 'SendAsync' falham **a menos que você defina 'BlockIfQueueFull' como 'true'.

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler`. If set, serialization failure happening when serializing keys are delegated to this handler which may provide a fallback value. Type: _string_
pt_br: O nome definido em '@Identifier' de um bean que implementa 'io.smallrye.reactive.messaging.kafka.SerializationFailureHandler'. Se definido, a falha de serialização que ocorre quando as chaves de serialização são delegadas a esse manipulador, que pode fornecer um valor de fallback. Tipo: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler`. If set, serialization failure happening when serializing values are delegated to this handler which may provide a fallback value. Type: _string_
pt_br: O nome definido em '@Identifier' de um bean que implementa 'io.smallrye.reactive.messaging.kafka.SerializationFailureHandler'. Se definido, a falha de serialização que ocorre quando os valores de serialização são delegados a esse manipulador, que pode fornecer um valor de fallback. Tipo: _string_

source: The native executable for our application will contain the application code, required libraries, Java APIs, and a reduced version of a VM. The smaller VM base improves the startup time of the application and produces a minimal disk footprint.
pt_br: O executável nativo da nossa aplicação conterá o código da aplicação, as bibliotecas necessárias, as APIs Java e uma versão reduzida de uma VM. A base menor da VM melhora o tempo de inicialização da aplicação e cria um espaço menor em disco.

source: The next section covers (2).
pt_br: A próxima seção aborda o tópico(2).

source: The node name identifier may be configured via the property `quarkus.transaction-manager.node-name`.
pt_br: O identificador do nome do nó pode ser configurado através da propriedade `quarkus.transaction-manager.node-name`.

source: The number of acknowledgments the producer requires the leader to have received before considering a request complete. This controls the durability of records that are sent. Accepted values are: 0, 1, all Type: _string_
pt_br: O número de reconhecimentos que o produtor exige que o líder tenha recebido antes de considerar um pedido completo. Isso controla a durabilidade dos registros que são enviados. Os valores aceitos são: 0, 1, todos Tipo: _string_

source: The number of concurrent lookup requests that can be sent on each broker connection. Setting a maximum prevents overloading a broker.
pt_br: O número de solicitações de pesquisa simultâneas que podem ser enviadas em cada conexão do broker. Definir um máximo evita sobrecarregar um broker.

source: The one current restriction is that extensions should work in both OpenJDK and GraalVM native executables. That is the guarantee we give Quarkus users (a cross compilation for their app). We have a maturity model to improve an extension to be fully "Quarked" and benefit from Quarkus, all done in incremental steps. Just hop on our https://quarkus.io/community/#discussions[mailing list] to discuss your ideas and get help. And you can start reading our https://quarkus.io/guides/writing-extensions[Writing extensions guide] as well or more simply get inspiration from the https://github.com/quarkusio/quarkus/tree/main/extensions[existing ones].
pt_br: A única restrição atual é que as extensões devem funcionar em executáveis nativos OpenJDK e GraalVM. Essa é a garantia que damos aos usuários do Quarkus (uma compilação cruzada para seu aplicativo). Temos um modelo de maturidade para melhorar uma extensão para ser totalmente "Quarked" e se beneficiar do Quarkus, tudo feito em etapas incrementais. Basta entrar em nossa https://quarkus.io/community/#discussions[lista de discussão] para discutir suas ideias e obter ajuda. E você pode começar a ler nossas https://quarkus.io/guides/writing-extensions[Guia para escrever extensões] também ou, mais simplesmente, se inspirar nas https://github.com/quarkusio/quarkus/tree/main/extensions[existentes].

source: The pooling case
pt_br: O caso do agrupamento (pooling)

source: The process for Gradle is analogous.
pt_br: O processo para o Gradle é análogo.

source: The project generation has also provided a `Dockerfile.native` in the `src/main/docker` directory with the following content:
pt_br: A geração do projeto também forneceu um `Dockerfile.native` na pasta `src/main/docker` com o seguinte conteúdo:

source: The properties are shown below:
pt_br: As propriedades são apresentadas abaixo:

source: The reason for this is that the local build driver invoked through `-Dquarkus.native.container-build=true` uses volume mounts to make the JAR available in the build container, but volume mounts do not work with remote daemons. The remote container build driver copies the necessary files instead of mounting them. Note that even though the remote driver also works with local daemons, the local driver should be preferred in the local case because mounting is usually more performant than copying.
pt_br: O motivo para isso é que o driver do build local é executado através do `-Dquarkus.native.container-build=true` que utiliza irá montar volumes para tornar o JAR disponível na build do contêiner, mas os volumes montados não funcionam com daemons remotos. O driver que faz a build do contêiner remoto copia apenas os arquivos necessários para montar ele. Observe que, embora o driver remoto também funcione com daemons locais, o driver local deve ser preferido no caso local porque a montagem é geralmente mais eficiente do que a cópia.

source: The recipe might not include a specific item in your project.
pt_br: A receita OpenRewrite pode não incluir um item específico do seu projeto.

source: The second stage is a minimal image copying the produced native executable
pt_br: O segundo estágio é uma imagem mínima que copia o executável nativo produzido

source: The serializer classname used to serialize the payload Type: _string_
pt_br: O nome da classe do serializador usado para serializar a carga útil Tipo: _string_

source: The serializer classname used to serialize the record's key Type: _string_
pt_br: O nome da classe do serializador usado para serializar a chave do registro Tipo: _string_

source: The service URL for the Pulsar service
pt_br: A URL do serviço Pulsar

source: The solution is located in the `funqy-google-cloud-functions-http-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-google-cloud-functions-http-quickstart[directory].
pt_br: A solução está localizada no link:{quickstarts-tree-url}/funqy-quickstarts/funqy-google-cloud-functions-http-quickstart[diretório] `funqy-google-cloud-functions-http-quickstart`.

source: The solution is located in the `getting-started` directory.
pt_br: A solução está localizada no diretório `getting-started`.

source: The solution is located in the `redis-quickstart` link:{quickstarts-tree-url}/redis-quickstart[directory].
pt_br: A solução está localizada no link:{quickstarts-tree-url}/redis-quickstart[diretório] `redis-quickstart` .

source: The source cache is located in the `target/sources` folder.
pt_br: A cache de fonte está localizado na pasta `target/sources`.

source: The target partition id. -1 to let the client determine the partition Type: _int_
pt_br: O id da partição de destino. -1 para permitir que o cliente determine a partição Tipo: _int_

source: The time interval to expire incomplete chunks if a consumer fails to receive all the chunks in the specified time period. The default value is 1 minute.
pt_br: O intervalo de tempo para expirar blocos incompletos se um consumidor não receber todos os blocos no período de tempo especificado. O valor padrão é 1 minuto.

source: The total bytes of memory the producer can use to buffer records waiting to be sent to the server. Type: _long_
pt_br: O total de bytes de memória que o produtor pode usar para armazenar em buffer registros aguardando para serem enviados ao servidor. Tipo: _long_

source: The user, `alice`, has `alice` as their password and `admin` as their role.
pt_br: O usuário, `alice`, tem `alice` como password e `admin` como role.

source: The user, `bob`, has `bob` as their password and `user` as their role.
pt_br: O usuário, `bob`, tem `bob` como senha e `user` como role.

source: The value held by the Redis key
pt_br: A variável `valor` que será o valor mantido pela chave Redis

source: The versions of musl and zlib may need to be updated to meet the native-image executable requirements (and UPX if you use native image compression).
pt_br: As versões de musl e zlib podem precisar serem atualizadas para atender os requisitos do executável de imagem nativa (e UPX se utilizar compressão de imagem nativa).

source: Then run it:
pt_br: Em seguida, execute:

source: Then, add to your `application.properties` file:
pt_br: Em seguida, adicione ao seu arquivo `application.properties`:

source: Then, if you didn't delete the generated native executable, you can build the docker image with:
pt_br: Depois, se não tiver deletado o executável nativo criado, pode construir a imagem docker com:

source: Then, open the `src/main/resources/application.properties` file and add:
pt_br: Em seguida, abra o arquivo `src/main/resources/application.properties` e adicione:

source: Then, use the `@CacheResult` and others cache annotations as explained in the xref:cache.adoc[Quarkus Cache guide]:
pt_br: Em seguida, utilize `@CacheResult` e outras anotações de cache do Quarkus, como explicado em xref:cache.adoc[Guia de cache Quarkus]:

source: There are two ways to achieve _priming_:
pt_br: Existem duas formas de obter _priming_:

source: These materials are for JUGs who have tour dates booked and want access to promotional materials to use to create excitement and drum up attendance. We've written a couple versions of the session abstracts so you could find one that fits your JUGs personality, or go for it and create your own! We've also created some <a href="{{site.baseurl}}/worldtour/graphics">graphic resources</a> for social promotions a well.
pt_br: Esses materiais são para JUGs que têm datas de turnê reservadas e querem acesso a materiais promocionais para usar para criar emoção e aumentar a participação. Nós escrevemos algumas versões dos resumos da sessão para que você possa encontrar um que se encaixe na sua personalidade JUGs, ou vá em frente e crie o seu próprio! Também criamos alguns <a href="{{site.baseurl}}/worldtour/graphics">recursos gráficos</a> para promoções sociais.

source: Think of Quarkus extensions as your project dependencies. Extensions configure, boot and integrate a framework or technology into your Quarkus application. They also do all of the heavy lifting of providing the right information to GraalVM for your application to compile natively. This will allow 3rd party projects to easily take advantage of the work we have done to make it easier to target GraalVM.
pt_br: Pense nas extensões do Quarkus como suas dependências de projeto. As extensões configuram, inicializam e integram uma estrutura ou tecnologia em seu aplicativo Quarkus. Eles também fazem todo o trabalho pesado de fornecer as informações certas para GraalVM para sua aplicação compilar nativamente. Isso permitirá que os projetos de terceiros aproveitem facilmente o trabalho que fizemos para facilitar o direcionamento do GraalVM.

source: This annotation defines your transaction boundaries and will wrap this call within a transaction.
pt_br: Essa anotação define os limites da transação e encapsulará essa chamada em uma transação.

source: This command generates a new project, importing the Redis extension.
pt_br: Este comando gera um novo projeto, importando a extensão Redis.

source: This command will start a Redis instance to execute the tests.
pt_br: Este comando iniciará uma instância Redis para executar os testes.

source: This environment variable resolves some incompatibilities between Quarkus and the AWS Lambda Custom Runtime environment.
pt_br: Esta variável de ambiente resolve algumas incompatibilidades entre o Quarkus e o ambiente AWS Lambda Custom Runtime.

source: This example uses TX_LOG as the datasource name.
pt_br: Este exemplo utiliza TX_LOG como o nome da fonte de dados.

source: This explain the specifics of using Hibernate ORM with Panache in a Kotlin project.
pt_br: Isso explica as especificidades do uso do Hibernate ORM com o Panache em um projeto Kotlin.

source: This extension is developed by a third party and is part of the Quarkus Platform.
pt_br: Esta extensão é desenvolvida por terceiros e faz parte da Plataforma Quarkus.

source: This guide covers how to deploy a native application on Kubernetes.
pt_br: Este guia aborda como implantar um aplicativo nativo no Kubernetes.

source: This guide covers how to deploy a native application on OpenShift.
pt_br: Este guia aborda como implantar um aplicativo nativo no OpenShift.

source: This guide covers how to use GCP BigQuery in Quarkus.
pt_br: Este guia aborda como usar o GCP BigQuery no Quarkus.

source: This guide covers how to use GCP Bigtable in Quarkus.
pt_br: Este guia aborda como usar o GCP Bigtable no Quarkus.

source: This guide covers how to use GCP Firestore in Quarkus.
pt_br: Este guia aborda como usar o GCP Firestore no Quarkus.

source: This guide covers how to use GCP PubSub in Quarkus.
pt_br: Este guia explica como utilizar o GCP PubSub no Quarkus.

source: This guide covers how to use GCP Secret Manager in Quarkus to consume configuration properties directly or via your `application.properties`.
pt_br: Este guia aborda como usar o GCP Secret Manager no Quarkus para consumir propriedades de configuração diretamente ou por meio de seu 'application.properties'.

source: This guide covers how to use GCP Spanner in Quarkus.
pt_br: Este guia explica como utilizar o GCP Spanner no Quarkus.

source: This guide covers how to use GCP Storage in Quarkus.
pt_br: Este guia aborda como usar o armazenamento GCP no Quarkus.

source: This guide covers how to use Hibernate Validator/Bean Validation in your REST services.
pt_br: Este guia aborda a forma de utilizar o validador Hibernate/Bean Validation nos seus serviços REST.

source: This guide covers how to use MongoDB in Quarkus.
pt_br: Este guia aborda como usar o MongoDB no Quarkus.

source: This guide covers how to use a Redis datastore in Quarkus.
pt_br: Este guia aborda como usar um datastore Redis no Quarkus.

source: This guide covers how to use an Elasticsearch cluster using the low level or high level REST clients.
pt_br: Este guia aborda como usar um cluster do Elasticsearch usando os clientes REST de baixo ou alto nível.

source: This guide covers how to use multiple GCP services.
pt_br: Este guia aborda como usar vários serviços GCP.

source: This guide covers how to use the AWS Systems Manager in Quarkus.
pt_br: Este guia aborda como usar o AWS Systems Manager no Quarkus.

source: This guide covers how to use the Amazon DynamoDB database in Quarkus.
pt_br: Este guia aborda como usar o banco de dados do Amazon DynamoDB no Quarkus.

source: This guide covers how to use the Amazon Identity and Access Management in Quarkus.
pt_br: Este guia aborda como usar o Amazon Identity and Access Management no Quarkus.

source: This guide covers how to use the Amazon Key Management Service in Quarkus.
pt_br: Este guia aborda como usar o Amazon Key Management Service no Quarkus.

source: This guide covers how to use the Amazon S3 cloud storage in Quarkus.
pt_br: Este guia aborda como usar o armazenamento em nuvem do Amazon S3 no Quarkus.

source: This guide covers how to use the Amazon Simple Email Service in Quarkus.
pt_br: Este guia aborda como usar o Amazon Simple Email Service no Quarkus.

source: This guide covers how to use the Amazon Simple Notification Service in Quarkus.
pt_br: Este guia aborda como usar o Amazon Simple Notification Service no Quarkus.

source: This guide covers how to use the Amazon Simple Queue Service in Quarkus.
pt_br: Este guia aborda como usar o Amazon Simple Queue Service no Quarkus.

source: This guide covers how to use the Apache Cassandra NoSQL database in Quarkus.
pt_br: Este guia aborda como usar o banco de dados Apache Cassandra NoSQL no Quarkus.

source: This guide covers how to use the Flyway extension to manage your schema migrations.
pt_br: Este guia aborda como usar a extensão Flyway para gerenciar suas migrações de esquema de banco de dados.

source: This guide covers how to use the Liquibase extension to manage your schema migrations.
pt_br: Este guia aborda como usar a extensão Liquibase para gerenciar suas migrações de esquema.

source: This guide covers how to use the Neo4j graph database in Quarkus.
pt_br: Este guia aborda como usar o banco de dados baseado em grafos Neo4j no Quarkus.

source: This guide covers how to use the Reactive SQL Clients in Quarkus.
pt_br: Este guia aborda como usar os clientes SQL reativos no Quarkus.

source: This guide covers the systems integration with Apache Camel
pt_br: Este guia aborda a integração de sistemas com o Apache Camel

source: This guide covers the usage of MongoDB using active records and repositories in a Kotlin project.
pt_br: Este guia aborda o uso do MongoDB usando <i>active records</i> e repositórios em um projeto Kotlin.
